summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCif_bf.h
/** \\brief  Mask for Ifx_CIF_BBB_KRSTCLR_Bits.CLR */
#define IFX_CIF_BBB_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_BBB_KRSTCLR_Bits.CLR */
#define IFX_CIF_BBB_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_CIF_BBB_MODID_Bits.MODNUMBER */
#define IFX_CIF_BBB_MODID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_CIF_BBB_MODID_Bits.MODNUMBER */
#define IFX_CIF_BBB_MODID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_CIF_BBB_MODID_Bits.MODNUMBER */
#define IFX_CIF_BBB_MODID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_CIF_BBB_MODID_Bits.MODREV */
#define IFX_CIF_BBB_MODID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_CIF_BBB_MODID_Bits.MODREV */
#define IFX_CIF_BBB_MODID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_CIF_BBB_MODID_Bits.MODREV */
#define IFX_CIF_BBB_MODID_MODREV_OFF (0)

/** \\brief  Length for Ifx_CIF_BBB_MODID_Bits.MODTYPE */
#define IFX_CIF_BBB_MODID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_CIF_BBB_MODID_Bits.MODTYPE */
#define IFX_CIF_BBB_MODID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_CIF_BBB_MODID_Bits.MODTYPE */
#define IFX_CIF_BBB_MODID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_CIF_CCL_Bits.CIF_CCLDISS */
#define IFX_CIF_CCL_CIF_CCLDISS_LEN (1)

/** \\brief  Mask for Ifx_CIF_CCL_Bits.CIF_CCLDISS */
#define IFX_CIF_CCL_CIF_CCLDISS_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_CCL_Bits.CIF_CCLDISS */
#define IFX_CIF_CCL_CIF_CCLDISS_OFF (1)

/** \\brief  Length for Ifx_CIF_CCL_Bits.CIF_CCLFDIS */
#define IFX_CIF_CCL_CIF_CCLFDIS_LEN (1)

/** \\brief  Mask for Ifx_CIF_CCL_Bits.CIF_CCLFDIS */
#define IFX_CIF_CCL_CIF_CCLFDIS_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_CCL_Bits.CIF_CCLFDIS */
#define IFX_CIF_CCL_CIF_CCLFDIS_OFF (2)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.DP_EN */
#define IFX_CIF_DP_CTRL_DP_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.DP_EN */
#define IFX_CIF_DP_CTRL_DP_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.DP_EN */
#define IFX_CIF_DP_CTRL_DP_EN_OFF (0)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.DP_SEL */
#define IFX_CIF_DP_CTRL_DP_SEL_LEN (3)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.DP_SEL */
#define IFX_CIF_DP_CTRL_DP_SEL_MSK (0x7)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.DP_SEL */
#define IFX_CIF_DP_CTRL_DP_SEL_OFF (1)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.FNC_EN */
#define IFX_CIF_DP_CTRL_FNC_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.FNC_EN */
#define IFX_CIF_DP_CTRL_FNC_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.FNC_EN */
#define IFX_CIF_DP_CTRL_FNC_EN_OFF (13)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.LNC_EN */
#define IFX_CIF_DP_CTRL_LNC_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.LNC_EN */
#define IFX_CIF_DP_CTRL_LNC_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.LNC_EN */
#define IFX_CIF_DP_CTRL_LNC_EN_OFF (14)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.RST_FNC */
#define IFX_CIF_DP_CTRL_RST_FNC_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.RST_FNC */
#define IFX_CIF_DP_CTRL_RST_FNC_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.RST_FNC */
#define IFX_CIF_DP_CTRL_RST_FNC_OFF (8)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.RST_LNC */
#define IFX_CIF_DP_CTRL_RST_LNC_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.RST_LNC */
#define IFX_CIF_DP_CTRL_RST_LNC_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.RST_LNC */
#define IFX_CIF_DP_CTRL_RST_LNC_OFF (9)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.RST_PD */
#define IFX_CIF_DP_CTRL_RST_PD_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.RST_PD */
#define IFX_CIF_DP_CTRL_RST_PD_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.RST_PD */
#define IFX_CIF_DP_CTRL_RST_PD_OFF (11)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.RST_TSC */
#define IFX_CIF_DP_CTRL_RST_TSC_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.RST_TSC */
#define IFX_CIF_DP_CTRL_RST_TSC_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.RST_TSC */
#define IFX_CIF_DP_CTRL_RST_TSC_OFF (10)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.TSC_EN */
#define IFX_CIF_DP_CTRL_TSC_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.TSC_EN */
#define IFX_CIF_DP_CTRL_TSC_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.TSC_EN */
#define IFX_CIF_DP_CTRL_TSC_EN_OFF (15)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS1 */
#define IFX_CIF_DP_CTRL_UDS1_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS1 */
#define IFX_CIF_DP_CTRL_UDS1_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS1 */
#define IFX_CIF_DP_CTRL_UDS1_OFF (16)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS2 */
#define IFX_CIF_DP_CTRL_UDS2_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS2 */
#define IFX_CIF_DP_CTRL_UDS2_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS2 */
#define IFX_CIF_DP_CTRL_UDS2_OFF (17)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS3 */
#define IFX_CIF_DP_CTRL_UDS3_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS3 */
#define IFX_CIF_DP_CTRL_UDS3_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS3 */
#define IFX_CIF_DP_CTRL_UDS3_OFF (18)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS4 */
#define IFX_CIF_DP_CTRL_UDS4_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS4 */
#define IFX_CIF_DP_CTRL_UDS4_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS4 */
#define IFX_CIF_DP_CTRL_UDS4_OFF (19)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS5 */
#define IFX_CIF_DP_CTRL_UDS5_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS5 */
#define IFX_CIF_DP_CTRL_UDS5_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS5 */
#define IFX_CIF_DP_CTRL_UDS5_OFF (20)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS6 */
#define IFX_CIF_DP_CTRL_UDS6_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS6 */
#define IFX_CIF_DP_CTRL_UDS6_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS6 */
#define IFX_CIF_DP_CTRL_UDS6_OFF (21)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS7 */
#define IFX_CIF_DP_CTRL_UDS7_LEN (1)

