summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCif_bf.h
/** \\brief  Offset for Ifx_CIF_EP_IC_RECENTER_Bits.RECENTER */
#define IFX_CIF_EP_IC_RECENTER_RECENTER_OFF (0)

/** \\brief  Length for Ifx_CIF_EP_IC_V_OFFS_SHD_Bits.V_OFFS_SHD */
#define IFX_CIF_EP_IC_V_OFFS_SHD_V_OFFS_SHD_LEN (12)

/** \\brief  Mask for Ifx_CIF_EP_IC_V_OFFS_SHD_Bits.V_OFFS_SHD */
#define IFX_CIF_EP_IC_V_OFFS_SHD_V_OFFS_SHD_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_EP_IC_V_OFFS_SHD_Bits.V_OFFS_SHD */
#define IFX_CIF_EP_IC_V_OFFS_SHD_V_OFFS_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_EP_IC_V_OFFS_Bits.V_OFFS */
#define IFX_CIF_EP_IC_V_OFFS_V_OFFS_LEN (12)

/** \\brief  Mask for Ifx_CIF_EP_IC_V_OFFS_Bits.V_OFFS */
#define IFX_CIF_EP_IC_V_OFFS_V_OFFS_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_EP_IC_V_OFFS_Bits.V_OFFS */
#define IFX_CIF_EP_IC_V_OFFS_V_OFFS_OFF (0)

/** \\brief  Length for Ifx_CIF_EP_IC_V_SIZE_SHD_Bits.V_SIZE_SHD */
#define IFX_CIF_EP_IC_V_SIZE_SHD_V_SIZE_SHD_LEN (12)

/** \\brief  Mask for Ifx_CIF_EP_IC_V_SIZE_SHD_Bits.V_SIZE_SHD */
#define IFX_CIF_EP_IC_V_SIZE_SHD_V_SIZE_SHD_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_EP_IC_V_SIZE_SHD_Bits.V_SIZE_SHD */
#define IFX_CIF_EP_IC_V_SIZE_SHD_V_SIZE_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_EP_IC_V_SIZE_Bits.V_SIZE */
#define IFX_CIF_EP_IC_V_SIZE_V_SIZE_LEN (12)

/** \\brief  Mask for Ifx_CIF_EP_IC_V_SIZE_Bits.V_SIZE */
#define IFX_CIF_EP_IC_V_SIZE_V_SIZE_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_EP_IC_V_SIZE_Bits.V_SIZE */
#define IFX_CIF_EP_IC_V_SIZE_V_SIZE_OFF (0)

/** \\brief  Length for Ifx_CIF_ICCL_Bits.CIF_DEBUG_PATH_CLK_EN */
#define IFX_CIF_ICCL_CIF_DEBUG_PATH_CLK_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_ICCL_Bits.CIF_DEBUG_PATH_CLK_EN */
#define IFX_CIF_ICCL_CIF_DEBUG_PATH_CLK_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ICCL_Bits.CIF_DEBUG_PATH_CLK_EN */
#define IFX_CIF_ICCL_CIF_DEBUG_PATH_CLK_EN_OFF (19)

/** \\brief  Length for Ifx_CIF_ICCL_Bits.CIF_EXTRA_PATHS_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_EXTRA_PATHS_CLK_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_ICCL_Bits.CIF_EXTRA_PATHS_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_EXTRA_PATHS_CLK_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ICCL_Bits.CIF_EXTRA_PATHS_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_EXTRA_PATHS_CLK_ENABLE_OFF (18)

/** \\brief  Length for Ifx_CIF_ICCL_Bits.CIF_ISP_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_ISP_CLK_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_ICCL_Bits.CIF_ISP_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_ISP_CLK_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ICCL_Bits.CIF_ISP_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_ISP_CLK_ENABLE_OFF (0)

/** \\brief  Length for Ifx_CIF_ICCL_Bits.CIF_JPEG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_JPEG_CLK_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_ICCL_Bits.CIF_JPEG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_JPEG_CLK_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ICCL_Bits.CIF_JPEG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_JPEG_CLK_ENABLE_OFF (5)

/** \\brief  Length for Ifx_CIF_ICCL_Bits.CIF_LIN_DSCALER_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_LIN_DSCALER_CLK_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_ICCL_Bits.CIF_LIN_DSCALER_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_LIN_DSCALER_CLK_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ICCL_Bits.CIF_LIN_DSCALER_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_LIN_DSCALER_CLK_ENABLE_OFF (17)

/** \\brief  Length for Ifx_CIF_ICCL_Bits.CIF_MI_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_MI_CLK_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_ICCL_Bits.CIF_MI_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_MI_CLK_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ICCL_Bits.CIF_MI_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_MI_CLK_ENABLE_OFF (6)

/** \\brief  Length for Ifx_CIF_ICCL_Bits.CIF_WATCHDOG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_WATCHDOG_CLK_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_ICCL_Bits.CIF_WATCHDOG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_WATCHDOG_CLK_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ICCL_Bits.CIF_WATCHDOG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_WATCHDOG_CLK_ENABLE_OFF (16)

/** \\brief  Length for Ifx_CIF_ID_Bits.MODNUMBER */
#define IFX_CIF_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_CIF_ID_Bits.MODNUMBER */
#define IFX_CIF_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_CIF_ID_Bits.MODNUMBER */
#define IFX_CIF_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_CIF_ID_Bits.MODREV */
#define IFX_CIF_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_CIF_ID_Bits.MODREV */
#define IFX_CIF_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_CIF_ID_Bits.MODREV */
#define IFX_CIF_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_CIF_ID_Bits.MODTYPE */
#define IFX_CIF_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_CIF_ID_Bits.MODTYPE */
#define IFX_CIF_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_CIF_ID_Bits.MODTYPE */
#define IFX_CIF_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_CIF_IRCL_Bits.CIF_DEBUG_PATH_RST */
#define IFX_CIF_IRCL_CIF_DEBUG_PATH_RST_LEN (1)

/** \\brief  Mask for Ifx_CIF_IRCL_Bits.CIF_DEBUG_PATH_RST */
#define IFX_CIF_IRCL_CIF_DEBUG_PATH_RST_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_IRCL_Bits.CIF_DEBUG_PATH_RST */
#define IFX_CIF_IRCL_CIF_DEBUG_PATH_RST_OFF (19)

/** \\brief  Length for Ifx_CIF_IRCL_Bits.CIF_EXTRA_PATHS_RST */
#define IFX_CIF_IRCL_CIF_EXTRA_PATHS_RST_LEN (1)

/** \\brief  Mask for Ifx_CIF_IRCL_Bits.CIF_EXTRA_PATHS_RST */
#define IFX_CIF_IRCL_CIF_EXTRA_PATHS_RST_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_IRCL_Bits.CIF_EXTRA_PATHS_RST */
#define IFX_CIF_IRCL_CIF_EXTRA_PATHS_RST_OFF (18)

/** \\brief  Length for Ifx_CIF_IRCL_Bits.CIF_GLOBAL_RST */
#define IFX_CIF_IRCL_CIF_GLOBAL_RST_LEN (1)

/** \\brief  Mask for Ifx_CIF_IRCL_Bits.CIF_GLOBAL_RST */
#define IFX_CIF_IRCL_CIF_GLOBAL_RST_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_IRCL_Bits.CIF_GLOBAL_RST */
#define IFX_CIF_IRCL_CIF_GLOBAL_RST_OFF (7)

/** \\brief  Length for Ifx_CIF_IRCL_Bits.CIF_ISP_SOFT_RST */
#define IFX_CIF_IRCL_CIF_ISP_SOFT_RST_LEN (1)

/** \\brief  Mask for Ifx_CIF_IRCL_Bits.CIF_ISP_SOFT_RST */
#define IFX_CIF_IRCL_CIF_ISP_SOFT_RST_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_IRCL_Bits.CIF_ISP_SOFT_RST */
#define IFX_CIF_IRCL_CIF_ISP_SOFT_RST_OFF (0)

/** \\brief  Length for Ifx_CIF_IRCL_Bits.CIF_JPEG_SOFT_RST */
#define IFX_CIF_IRCL_CIF_JPEG_SOFT_RST_LEN (1)

/** \\brief  Mask for Ifx_CIF_IRCL_Bits.CIF_JPEG_SOFT_RST */
#define IFX_CIF_IRCL_CIF_JPEG_SOFT_RST_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_IRCL_Bits.CIF_JPEG_SOFT_RST */
#define IFX_CIF_IRCL_CIF_JPEG_SOFT_RST_OFF (5)

/** \\brief  Length for Ifx_CIF_IRCL_Bits.CIF_LIN_DSCALER_RST */
#define IFX_CIF_IRCL_CIF_LIN_DSCALER_RST_LEN (1)

/** \\brief  Mask for Ifx_CIF_IRCL_Bits.CIF_LIN_DSCALER_RST */
#define IFX_CIF_IRCL_CIF_LIN_DSCALER_RST_MSK (0x1)

