summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCif_bf.h
/** \\brief  Length for Ifx_CIF_ISP_ISR_Bits.ISR_FRAME */
#define IFX_CIF_ISP_ISR_ISR_FRAME_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ISR_Bits.ISR_FRAME */
#define IFX_CIF_ISP_ISR_ISR_FRAME_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ISR_Bits.ISR_FRAME */
#define IFX_CIF_ISP_ISR_ISR_FRAME_OFF (1)

/** \\brief  Length for Ifx_CIF_ISP_ISR_Bits.ISR_H_START */
#define IFX_CIF_ISP_ISR_ISR_H_START_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ISR_Bits.ISR_H_START */
#define IFX_CIF_ISP_ISR_ISR_H_START_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ISR_Bits.ISR_H_START */
#define IFX_CIF_ISP_ISR_ISR_H_START_OFF (7)

/** \\brief  Length for Ifx_CIF_ISP_ISR_Bits.ISR_ISP_OFF */
#define IFX_CIF_ISP_ISR_ISR_ISP_OFF_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ISR_Bits.ISR_ISP_OFF */
#define IFX_CIF_ISP_ISR_ISR_ISP_OFF_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ISR_Bits.ISR_ISP_OFF */
#define IFX_CIF_ISP_ISR_ISR_ISP_OFF_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_ISR_Bits.ISR_PIC_SIZE_ERR */
#define IFX_CIF_ISP_ISR_ISR_PIC_SIZE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ISR_Bits.ISR_PIC_SIZE_ERR */
#define IFX_CIF_ISP_ISR_ISR_PIC_SIZE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ISR_Bits.ISR_PIC_SIZE_ERR */
#define IFX_CIF_ISP_ISR_ISR_PIC_SIZE_ERR_OFF (3)

/** \\brief  Length for Ifx_CIF_ISP_ISR_Bits.ISR_V_START */
#define IFX_CIF_ISP_ISR_ISR_V_START_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ISR_Bits.ISR_V_START */
#define IFX_CIF_ISP_ISR_ISR_V_START_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ISR_Bits.ISR_V_START */
#define IFX_CIF_ISP_ISR_ISR_V_START_OFF (6)

/** \\brief  Length for Ifx_CIF_ISP_ISR_Bits.ISR_WD_TRIG */
#define IFX_CIF_ISP_ISR_ISR_WD_TRIG_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ISR_Bits.ISR_WD_TRIG */
#define IFX_CIF_ISP_ISR_ISR_WD_TRIG_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ISR_Bits.ISR_WD_TRIG */
#define IFX_CIF_ISP_ISR_ISR_WD_TRIG_OFF (19)

/** \\brief  Length for Ifx_CIF_ISP_MIS_Bits.MIS_DATA_LOSS */
#define IFX_CIF_ISP_MIS_MIS_DATA_LOSS_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_MIS_Bits.MIS_DATA_LOSS */
#define IFX_CIF_ISP_MIS_MIS_DATA_LOSS_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_MIS_Bits.MIS_DATA_LOSS */
#define IFX_CIF_ISP_MIS_MIS_DATA_LOSS_OFF (2)

/** \\brief  Length for Ifx_CIF_ISP_MIS_Bits.MIS_FRAME_IN */
#define IFX_CIF_ISP_MIS_MIS_FRAME_IN_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_MIS_Bits.MIS_FRAME_IN */
#define IFX_CIF_ISP_MIS_MIS_FRAME_IN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_MIS_Bits.MIS_FRAME_IN */
#define IFX_CIF_ISP_MIS_MIS_FRAME_IN_OFF (5)

/** \\brief  Length for Ifx_CIF_ISP_MIS_Bits.MIS_FRAME */
#define IFX_CIF_ISP_MIS_MIS_FRAME_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_MIS_Bits.MIS_FRAME */
#define IFX_CIF_ISP_MIS_MIS_FRAME_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_MIS_Bits.MIS_FRAME */
#define IFX_CIF_ISP_MIS_MIS_FRAME_OFF (1)

/** \\brief  Length for Ifx_CIF_ISP_MIS_Bits.MIS_H_START */
#define IFX_CIF_ISP_MIS_MIS_H_START_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_MIS_Bits.MIS_H_START */
#define IFX_CIF_ISP_MIS_MIS_H_START_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_MIS_Bits.MIS_H_START */
#define IFX_CIF_ISP_MIS_MIS_H_START_OFF (7)

/** \\brief  Length for Ifx_CIF_ISP_MIS_Bits.MIS_ISP_OFF */
#define IFX_CIF_ISP_MIS_MIS_ISP_OFF_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_MIS_Bits.MIS_ISP_OFF */
#define IFX_CIF_ISP_MIS_MIS_ISP_OFF_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_MIS_Bits.MIS_ISP_OFF */
#define IFX_CIF_ISP_MIS_MIS_ISP_OFF_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_MIS_Bits.MIS_PIC_SIZE_ERR */
#define IFX_CIF_ISP_MIS_MIS_PIC_SIZE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_MIS_Bits.MIS_PIC_SIZE_ERR */
#define IFX_CIF_ISP_MIS_MIS_PIC_SIZE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_MIS_Bits.MIS_PIC_SIZE_ERR */
#define IFX_CIF_ISP_MIS_MIS_PIC_SIZE_ERR_OFF (3)

/** \\brief  Length for Ifx_CIF_ISP_MIS_Bits.MIS_V_START */
#define IFX_CIF_ISP_MIS_MIS_V_START_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_MIS_Bits.MIS_V_START */
#define IFX_CIF_ISP_MIS_MIS_V_START_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_MIS_Bits.MIS_V_START */
#define IFX_CIF_ISP_MIS_MIS_V_START_OFF (6)

/** \\brief  Length for Ifx_CIF_ISP_MIS_Bits.MIS_WD_TRIG */
#define IFX_CIF_ISP_MIS_MIS_WD_TRIG_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_MIS_Bits.MIS_WD_TRIG */
#define IFX_CIF_ISP_MIS_MIS_WD_TRIG_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_MIS_Bits.MIS_WD_TRIG */
#define IFX_CIF_ISP_MIS_MIS_WD_TRIG_OFF (19)

/** \\brief  Length for Ifx_CIF_ISP_OUT_H_OFFS_Bits.ISP_OUT_H_OFFS */
#define IFX_CIF_ISP_OUT_H_OFFS_ISP_OUT_H_OFFS_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISP_OUT_H_OFFS_Bits.ISP_OUT_H_OFFS */
#define IFX_CIF_ISP_OUT_H_OFFS_ISP_OUT_H_OFFS_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISP_OUT_H_OFFS_Bits.ISP_OUT_H_OFFS */
#define IFX_CIF_ISP_OUT_H_OFFS_ISP_OUT_H_OFFS_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_OUT_H_OFFS_SHD_Bits.ISP_OUT_H_OFFS_SHD */
#define IFX_CIF_ISP_OUT_H_OFFS_SHD_ISP_OUT_H_OFFS_SHD_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISP_OUT_H_OFFS_SHD_Bits.ISP_OUT_H_OFFS_SHD */
#define IFX_CIF_ISP_OUT_H_OFFS_SHD_ISP_OUT_H_OFFS_SHD_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISP_OUT_H_OFFS_SHD_Bits.ISP_OUT_H_OFFS_SHD */
#define IFX_CIF_ISP_OUT_H_OFFS_SHD_ISP_OUT_H_OFFS_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_OUT_H_SIZE_Bits.ISP_OUT_H_SIZE */
#define IFX_CIF_ISP_OUT_H_SIZE_ISP_OUT_H_SIZE_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISP_OUT_H_SIZE_Bits.ISP_OUT_H_SIZE */
#define IFX_CIF_ISP_OUT_H_SIZE_ISP_OUT_H_SIZE_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISP_OUT_H_SIZE_Bits.ISP_OUT_H_SIZE */
#define IFX_CIF_ISP_OUT_H_SIZE_ISP_OUT_H_SIZE_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_OUT_H_SIZE_SHD_Bits.ISP_OUT_H_SIZE_SHD */
#define IFX_CIF_ISP_OUT_H_SIZE_SHD_ISP_OUT_H_SIZE_SHD_LEN (13)

/** \\brief  Mask for Ifx_CIF_ISP_OUT_H_SIZE_SHD_Bits.ISP_OUT_H_SIZE_SHD */
#define IFX_CIF_ISP_OUT_H_SIZE_SHD_ISP_OUT_H_SIZE_SHD_MSK (0x1fff)

/** \\brief  Offset for Ifx_CIF_ISP_OUT_H_SIZE_SHD_Bits.ISP_OUT_H_SIZE_SHD */
#define IFX_CIF_ISP_OUT_H_SIZE_SHD_ISP_OUT_H_SIZE_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_OUT_V_OFFS_Bits.ISP_OUT_V_OFFS */
#define IFX_CIF_ISP_OUT_V_OFFS_ISP_OUT_V_OFFS_LEN (12)

