summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCif_bf.h
/** \\brief  Length for Ifx_CIF_ISPIS_H_SIZE_SHD_Bits.ISP_H_SIZE_SHD */
#define IFX_CIF_ISPIS_H_SIZE_SHD_ISP_H_SIZE_SHD_LEN (13)

/** \\brief  Mask for Ifx_CIF_ISPIS_H_SIZE_SHD_Bits.ISP_H_SIZE_SHD */
#define IFX_CIF_ISPIS_H_SIZE_SHD_ISP_H_SIZE_SHD_MSK (0x1fff)

/** \\brief  Offset for Ifx_CIF_ISPIS_H_SIZE_SHD_Bits.ISP_H_SIZE_SHD */
#define IFX_CIF_ISPIS_H_SIZE_SHD_ISP_H_SIZE_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_ISPIS_MAX_DX_Bits.IS_MAX_DX */
#define IFX_CIF_ISPIS_MAX_DX_IS_MAX_DX_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISPIS_MAX_DX_Bits.IS_MAX_DX */
#define IFX_CIF_ISPIS_MAX_DX_IS_MAX_DX_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISPIS_MAX_DX_Bits.IS_MAX_DX */
#define IFX_CIF_ISPIS_MAX_DX_IS_MAX_DX_OFF (0)

/** \\brief  Length for Ifx_CIF_ISPIS_MAX_DY_Bits.IS_MAX_DY */
#define IFX_CIF_ISPIS_MAX_DY_IS_MAX_DY_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISPIS_MAX_DY_Bits.IS_MAX_DY */
#define IFX_CIF_ISPIS_MAX_DY_IS_MAX_DY_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISPIS_MAX_DY_Bits.IS_MAX_DY */
#define IFX_CIF_ISPIS_MAX_DY_IS_MAX_DY_OFF (0)

/** \\brief  Length for Ifx_CIF_ISPIS_RECENTER_Bits.RECENTER */
#define IFX_CIF_ISPIS_RECENTER_RECENTER_LEN (3)

/** \\brief  Mask for Ifx_CIF_ISPIS_RECENTER_Bits.RECENTER */
#define IFX_CIF_ISPIS_RECENTER_RECENTER_MSK (0x7)

/** \\brief  Offset for Ifx_CIF_ISPIS_RECENTER_Bits.RECENTER */
#define IFX_CIF_ISPIS_RECENTER_RECENTER_OFF (0)

/** \\brief  Length for Ifx_CIF_ISPIS_V_OFFS_Bits.IS_V_OFFS */
#define IFX_CIF_ISPIS_V_OFFS_IS_V_OFFS_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISPIS_V_OFFS_Bits.IS_V_OFFS */
#define IFX_CIF_ISPIS_V_OFFS_IS_V_OFFS_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISPIS_V_OFFS_Bits.IS_V_OFFS */
#define IFX_CIF_ISPIS_V_OFFS_IS_V_OFFS_OFF (0)

/** \\brief  Length for Ifx_CIF_ISPIS_V_OFFS_SHD_Bits.IS_V_OFFS_SHD */
#define IFX_CIF_ISPIS_V_OFFS_SHD_IS_V_OFFS_SHD_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISPIS_V_OFFS_SHD_Bits.IS_V_OFFS_SHD */
#define IFX_CIF_ISPIS_V_OFFS_SHD_IS_V_OFFS_SHD_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISPIS_V_OFFS_SHD_Bits.IS_V_OFFS_SHD */
#define IFX_CIF_ISPIS_V_OFFS_SHD_IS_V_OFFS_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_ISPIS_V_SIZE_Bits.IS_V_SIZE */
#define IFX_CIF_ISPIS_V_SIZE_IS_V_SIZE_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISPIS_V_SIZE_Bits.IS_V_SIZE */
#define IFX_CIF_ISPIS_V_SIZE_IS_V_SIZE_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISPIS_V_SIZE_Bits.IS_V_SIZE */
#define IFX_CIF_ISPIS_V_SIZE_IS_V_SIZE_OFF (0)

/** \\brief  Length for Ifx_CIF_ISPIS_V_SIZE_SHD_Bits.ISP_V_SIZE_SHD */
#define IFX_CIF_ISPIS_V_SIZE_SHD_ISP_V_SIZE_SHD_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISPIS_V_SIZE_SHD_Bits.ISP_V_SIZE_SHD */
#define IFX_CIF_ISPIS_V_SIZE_SHD_ISP_V_SIZE_SHD_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISPIS_V_SIZE_SHD_Bits.ISP_V_SIZE_SHD */
#define IFX_CIF_ISPIS_V_SIZE_SHD_ISP_V_SIZE_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_JPE_AC_TABLE_SELECT_Bits.AC_TABLE_SELECT */
#define IFX_CIF_JPE_AC_TABLE_SELECT_AC_TABLE_SELECT_LEN (3)

/** \\brief  Mask for Ifx_CIF_JPE_AC_TABLE_SELECT_Bits.AC_TABLE_SELECT */
#define IFX_CIF_JPE_AC_TABLE_SELECT_AC_TABLE_SELECT_MSK (0x7)

/** \\brief  Offset for Ifx_CIF_JPE_AC_TABLE_SELECT_Bits.AC_TABLE_SELECT */
#define IFX_CIF_JPE_AC_TABLE_SELECT_AC_TABLE_SELECT_OFF (0)

/** \\brief  Length for Ifx_CIF_JPE_CBCR_SCALE_EN_Bits.CBCR_SCALE_EN */
#define IFX_CIF_JPE_CBCR_SCALE_EN_CBCR_SCALE_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_CBCR_SCALE_EN_Bits.CBCR_SCALE_EN */
#define IFX_CIF_JPE_CBCR_SCALE_EN_CBCR_SCALE_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_CBCR_SCALE_EN_Bits.CBCR_SCALE_EN */
#define IFX_CIF_JPE_CBCR_SCALE_EN_CBCR_SCALE_EN_OFF (0)

/** \\brief  Length for Ifx_CIF_JPE_DC_TABLE_SELECT_Bits.DC_TABLE_SELECT */
#define IFX_CIF_JPE_DC_TABLE_SELECT_DC_TABLE_SELECT_LEN (3)

/** \\brief  Mask for Ifx_CIF_JPE_DC_TABLE_SELECT_Bits.DC_TABLE_SELECT */
#define IFX_CIF_JPE_DC_TABLE_SELECT_DC_TABLE_SELECT_MSK (0x7)

/** \\brief  Offset for Ifx_CIF_JPE_DC_TABLE_SELECT_Bits.DC_TABLE_SELECT */
#define IFX_CIF_JPE_DC_TABLE_SELECT_DC_TABLE_SELECT_OFF (0)

/** \\brief  Length for Ifx_CIF_JPE_DEBUG_Bits.DEB_BAD_TABLE_ACCESS */
#define IFX_CIF_JPE_DEBUG_DEB_BAD_TABLE_ACCESS_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_DEBUG_Bits.DEB_BAD_TABLE_ACCESS */
#define IFX_CIF_JPE_DEBUG_DEB_BAD_TABLE_ACCESS_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_DEBUG_Bits.DEB_BAD_TABLE_ACCESS */
#define IFX_CIF_JPE_DEBUG_DEB_BAD_TABLE_ACCESS_OFF (8)

/** \\brief  Length for Ifx_CIF_JPE_DEBUG_Bits.DEB_QIQ_TABLE_ACC */
#define IFX_CIF_JPE_DEBUG_DEB_QIQ_TABLE_ACC_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_DEBUG_Bits.DEB_QIQ_TABLE_ACC */
#define IFX_CIF_JPE_DEBUG_DEB_QIQ_TABLE_ACC_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_DEBUG_Bits.DEB_QIQ_TABLE_ACC */
#define IFX_CIF_JPE_DEBUG_DEB_QIQ_TABLE_ACC_OFF (2)

/** \\brief  Length for Ifx_CIF_JPE_DEBUG_Bits.DEB_R2B_MEMORY_FULL */
#define IFX_CIF_JPE_DEBUG_DEB_R2B_MEMORY_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_DEBUG_Bits.DEB_R2B_MEMORY_FULL */
#define IFX_CIF_JPE_DEBUG_DEB_R2B_MEMORY_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_DEBUG_Bits.DEB_R2B_MEMORY_FULL */
#define IFX_CIF_JPE_DEBUG_DEB_R2B_MEMORY_FULL_OFF (4)

/** \\brief  Length for Ifx_CIF_JPE_DEBUG_Bits.DEB_VLC_ENCODE_BUSY */
#define IFX_CIF_JPE_DEBUG_DEB_VLC_ENCODE_BUSY_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_DEBUG_Bits.DEB_VLC_ENCODE_BUSY */
#define IFX_CIF_JPE_DEBUG_DEB_VLC_ENCODE_BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_DEBUG_Bits.DEB_VLC_ENCODE_BUSY */
#define IFX_CIF_JPE_DEBUG_DEB_VLC_ENCODE_BUSY_OFF (3)

/** \\brief  Length for Ifx_CIF_JPE_DEBUG_Bits.DEB_VLC_TABLE_BUSY */
#define IFX_CIF_JPE_DEBUG_DEB_VLC_TABLE_BUSY_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_DEBUG_Bits.DEB_VLC_TABLE_BUSY */
#define IFX_CIF_JPE_DEBUG_DEB_VLC_TABLE_BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_DEBUG_Bits.DEB_VLC_TABLE_BUSY */
#define IFX_CIF_JPE_DEBUG_DEB_VLC_TABLE_BUSY_OFF (5)

/** \\brief  Length for Ifx_CIF_JPE_ENC_HSIZE_Bits.ENC_HSIZE */
#define IFX_CIF_JPE_ENC_HSIZE_ENC_HSIZE_LEN (12)

/** \\brief  Mask for Ifx_CIF_JPE_ENC_HSIZE_Bits.ENC_HSIZE */
#define IFX_CIF_JPE_ENC_HSIZE_ENC_HSIZE_MSK (0xfff)

