summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCif_bf.h
/** \\brief  Length for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_TABLE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_TABLE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_TABLE_ERR_OFF (10)

/** \\brief  Length for Ifx_CIF_JPE_ERROR_RIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_RIS_DCT_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_ERROR_RIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_RIS_DCT_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_ERROR_RIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_RIS_DCT_ERR_OFF (7)

/** \\brief  Length for Ifx_CIF_JPE_ERROR_RIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_R2B_IMG_SIZE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_ERROR_RIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_R2B_IMG_SIZE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_ERROR_RIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_R2B_IMG_SIZE_ERR_OFF (9)

/** \\brief  Length for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_SYMBOL_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_SYMBOL_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_SYMBOL_ERR_OFF (4)

/** \\brief  Length for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_TABLE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_TABLE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_TABLE_ERR_OFF (10)

/** \\brief  Length for Ifx_CIF_JPE_GEN_HEADER_Bits.GEN_HEADER */
#define IFX_CIF_JPE_GEN_HEADER_GEN_HEADER_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_GEN_HEADER_Bits.GEN_HEADER */
#define IFX_CIF_JPE_GEN_HEADER_GEN_HEADER_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_GEN_HEADER_Bits.GEN_HEADER */
#define IFX_CIF_JPE_GEN_HEADER_GEN_HEADER_OFF (0)

/** \\brief  Length for Ifx_CIF_JPE_HEADER_MODE_Bits.HEADER_MODE */
#define IFX_CIF_JPE_HEADER_MODE_HEADER_MODE_LEN (2)

/** \\brief  Mask for Ifx_CIF_JPE_HEADER_MODE_Bits.HEADER_MODE */
#define IFX_CIF_JPE_HEADER_MODE_HEADER_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_JPE_HEADER_MODE_Bits.HEADER_MODE */
#define IFX_CIF_JPE_HEADER_MODE_HEADER_MODE_OFF (0)

/** \\brief  Length for Ifx_CIF_JPE_INIT_Bits.JP_INIT */
#define IFX_CIF_JPE_INIT_JP_INIT_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_INIT_Bits.JP_INIT */
#define IFX_CIF_JPE_INIT_JP_INIT_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_INIT_Bits.JP_INIT */
#define IFX_CIF_JPE_INIT_JP_INIT_OFF (0)

/** \\brief  Length for Ifx_CIF_JPE_PIC_FORMAT_Bits.ENC_PIC_FORMAT */
#define IFX_CIF_JPE_PIC_FORMAT_ENC_PIC_FORMAT_LEN (3)

/** \\brief  Mask for Ifx_CIF_JPE_PIC_FORMAT_Bits.ENC_PIC_FORMAT */
#define IFX_CIF_JPE_PIC_FORMAT_ENC_PIC_FORMAT_MSK (0x7)

/** \\brief  Offset for Ifx_CIF_JPE_PIC_FORMAT_Bits.ENC_PIC_FORMAT */
#define IFX_CIF_JPE_PIC_FORMAT_ENC_PIC_FORMAT_OFF (0)

/** \\brief  Length for Ifx_CIF_JPE_RESTART_INTERVAL_Bits.RESTART_INTERVAL */
#define IFX_CIF_JPE_RESTART_INTERVAL_RESTART_INTERVAL_LEN (16)

/** \\brief  Mask for Ifx_CIF_JPE_RESTART_INTERVAL_Bits.RESTART_INTERVAL */
#define IFX_CIF_JPE_RESTART_INTERVAL_RESTART_INTERVAL_MSK (0xffff)

/** \\brief  Offset for Ifx_CIF_JPE_RESTART_INTERVAL_Bits.RESTART_INTERVAL */
#define IFX_CIF_JPE_RESTART_INTERVAL_RESTART_INTERVAL_OFF (0)

/** \\brief  Length for Ifx_CIF_JPE_STATUS_ICR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ICR_ENCODE_DONE_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_STATUS_ICR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ICR_ENCODE_DONE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_STATUS_ICR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ICR_ENCODE_DONE_OFF (4)

/** \\brief  Length for Ifx_CIF_JPE_STATUS_ICR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ICR_GEN_HEADER_DONE_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_STATUS_ICR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ICR_GEN_HEADER_DONE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_STATUS_ICR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ICR_GEN_HEADER_DONE_OFF (5)

/** \\brief  Length for Ifx_CIF_JPE_STATUS_IMR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_IMR_ENCODE_DONE_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_STATUS_IMR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_IMR_ENCODE_DONE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_STATUS_IMR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_IMR_ENCODE_DONE_OFF (4)

/** \\brief  Length for Ifx_CIF_JPE_STATUS_IMR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_IMR_GEN_HEADER_DONE_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_STATUS_IMR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_IMR_GEN_HEADER_DONE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_STATUS_IMR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_IMR_GEN_HEADER_DONE_OFF (5)

/** \\brief  Length for Ifx_CIF_JPE_STATUS_ISR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ISR_ENCODE_DONE_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_STATUS_ISR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ISR_ENCODE_DONE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_STATUS_ISR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ISR_ENCODE_DONE_OFF (4)

/** \\brief  Length for Ifx_CIF_JPE_STATUS_ISR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ISR_GEN_HEADER_DONE_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_STATUS_ISR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ISR_GEN_HEADER_DONE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_STATUS_ISR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ISR_GEN_HEADER_DONE_OFF (5)

/** \\brief  Length for Ifx_CIF_JPE_STATUS_MIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_MIS_ENCODE_DONE_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_STATUS_MIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_MIS_ENCODE_DONE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_STATUS_MIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_MIS_ENCODE_DONE_OFF (4)

/** \\brief  Length for Ifx_CIF_JPE_STATUS_MIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_MIS_GEN_HEADER_DONE_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_STATUS_MIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_MIS_GEN_HEADER_DONE_MSK (0x1)

