summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCif_bf.h
/** \\brief  Mask for Ifx_CIF_LDS_FAC_Bits.LDS_V_FAC */
#define IFX_CIF_LDS_FAC_LDS_V_FAC_MSK (0xff)

/** \\brief  Offset for Ifx_CIF_LDS_FAC_Bits.LDS_V_FAC */
#define IFX_CIF_LDS_FAC_LDS_V_FAC_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_BYTE_CNT_Bits.BYTE_CNT */
#define IFX_CIF_MI_BYTE_CNT_BYTE_CNT_LEN (24)

/** \\brief  Mask for Ifx_CIF_MI_BYTE_CNT_Bits.BYTE_CNT */
#define IFX_CIF_MI_BYTE_CNT_BYTE_CNT_MSK (0xffffff)

/** \\brief  Offset for Ifx_CIF_MI_BYTE_CNT_Bits.BYTE_CNT */
#define IFX_CIF_MI_BYTE_CNT_BYTE_CNT_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_CHROM */
#define IFX_CIF_MI_CTRL_BURST_LEN_CHROM_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_CHROM */
#define IFX_CIF_MI_CTRL_BURST_LEN_CHROM_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_CHROM */
#define IFX_CIF_MI_CTRL_BURST_LEN_CHROM_OFF (18)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_LUM */
#define IFX_CIF_MI_CTRL_BURST_LEN_LUM_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_LUM */
#define IFX_CIF_MI_CTRL_BURST_LEN_LUM_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_LUM */
#define IFX_CIF_MI_CTRL_BURST_LEN_LUM_OFF (16)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MI_CTRL_BYTE_SWAP_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MI_CTRL_BYTE_SWAP_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MI_CTRL_BYTE_SWAP_OFF (7)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MI_CTRL_INIT_BASE_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MI_CTRL_INIT_BASE_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MI_CTRL_INIT_BASE_EN_OFF (20)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MI_CTRL_INIT_OFFSET_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MI_CTRL_INIT_OFFSET_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MI_CTRL_INIT_OFFSET_EN_OFF (21)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.JPEG_ENABLE */
#define IFX_CIF_MI_CTRL_JPEG_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.JPEG_ENABLE */
#define IFX_CIF_MI_CTRL_JPEG_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.JPEG_ENABLE */
#define IFX_CIF_MI_CTRL_JPEG_ENABLE_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.MP_ENABLE */
#define IFX_CIF_MI_CTRL_MP_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.MP_ENABLE */
#define IFX_CIF_MI_CTRL_MP_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.MP_ENABLE */
#define IFX_CIF_MI_CTRL_MP_ENABLE_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.MP_WRITE_FORMAT */
#define IFX_CIF_MI_CTRL_MP_WRITE_FORMAT_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.MP_WRITE_FORMAT */
#define IFX_CIF_MI_CTRL_MP_WRITE_FORMAT_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.MP_WRITE_FORMAT */
#define IFX_CIF_MI_CTRL_MP_WRITE_FORMAT_OFF (22)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.RAW_ENABLE */
#define IFX_CIF_MI_CTRL_RAW_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.RAW_ENABLE */
#define IFX_CIF_MI_CTRL_RAW_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.RAW_ENABLE */
#define IFX_CIF_MI_CTRL_RAW_ENABLE_OFF (3)

/** \\brief  Length for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_IN_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_IN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_IN_OFF (4)

/** \\brief  Length for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_OUT_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_OUT_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_OUT_OFF (18)

/** \\brief  Length for Ifx_CIF_MI_CTRL_SHD_Bits.MP_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_MP_ENABLE_IN_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_SHD_Bits.MP_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_MP_ENABLE_IN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_SHD_Bits.MP_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_MP_ENABLE_IN_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_CTRL_SHD_Bits.MP_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_MP_ENABLE_OUT_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_SHD_Bits.MP_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_MP_ENABLE_OUT_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_SHD_Bits.MP_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_MP_ENABLE_OUT_OFF (16)

/** \\brief  Length for Ifx_CIF_MI_CTRL_SHD_Bits.RAW_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_RAW_ENABLE_IN_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_SHD_Bits.RAW_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_RAW_ENABLE_IN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_SHD_Bits.RAW_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_RAW_ENABLE_IN_OFF (5)

/** \\brief  Length for Ifx_CIF_MI_CTRL_SHD_Bits.RAW_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_RAW_ENABLE_OUT_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_SHD_Bits.RAW_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_RAW_ENABLE_OUT_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_SHD_Bits.RAW_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_RAW_ENABLE_OUT_OFF (19)

/** \\brief  Length for Ifx_CIF_MI_ICR_Bits.BUS_ERROR */
#define IFX_CIF_MI_ICR_BUS_ERROR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ICR_Bits.BUS_ERROR */
#define IFX_CIF_MI_ICR_BUS_ERROR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ICR_Bits.BUS_ERROR */
#define IFX_CIF_MI_ICR_BUS_ERROR_OFF (10)

/** \\brief  Length for Ifx_CIF_MI_ICR_Bits.FILL_MPY */
#define IFX_CIF_MI_ICR_FILL_MPY_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ICR_Bits.FILL_MPY */
#define IFX_CIF_MI_ICR_FILL_MPY_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ICR_Bits.FILL_MPY */
#define IFX_CIF_MI_ICR_FILL_MPY_OFF (3)

/** \\brief  Length for Ifx_CIF_MI_ICR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ICR_MBLK_LINE_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ICR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ICR_MBLK_LINE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ICR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ICR_MBLK_LINE_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_ICR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ICR_MP_FRAME_END_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ICR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ICR_MP_FRAME_END_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ICR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ICR_MP_FRAME_END_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ICR_WRAP_MP_CB_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ICR_WRAP_MP_CB_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ICR_WRAP_MP_CB_OFF (5)

/** \\brief  Length for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ICR_WRAP_MP_CR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ICR_WRAP_MP_CR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ICR_WRAP_MP_CR_OFF (6)

/** \\brief  Length for Ifx_CIF_MI_ICR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ICR_WRAP_MP_Y_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ICR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ICR_WRAP_MP_Y_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ICR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ICR_WRAP_MP_Y_OFF (4)

