summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCif_bf.h
/** \\brief  Length for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.MP_Y_IRQ_OFFS_INIT */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_MP_Y_IRQ_OFFS_INIT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.MP_Y_IRQ_OFFS_INIT */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_MP_Y_IRQ_OFFS_INIT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.MP_Y_IRQ_OFFS_INIT */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_MP_Y_IRQ_OFFS_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.MP_Y_IRQ_OFFS */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_MP_Y_IRQ_OFFS_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.MP_Y_IRQ_OFFS */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_MP_Y_IRQ_OFFS_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.MP_Y_IRQ_OFFS */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_MP_Y_IRQ_OFFS_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.MP_Y_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_MP_Y_OFFS_CNT_INIT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.MP_Y_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_MP_Y_OFFS_CNT_INIT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.MP_Y_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_MP_Y_OFFS_CNT_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.MP_Y_OFFS_CNT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_MP_Y_OFFS_CNT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.MP_Y_OFFS_CNT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_MP_Y_OFFS_CNT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.MP_Y_OFFS_CNT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_MP_Y_OFFS_CNT_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.MP_Y_OFFS_CNT_START */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_MP_Y_OFFS_CNT_START_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.MP_Y_OFFS_CNT_START */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_MP_Y_OFFS_CNT_START_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.MP_Y_OFFS_CNT_START */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_MP_Y_OFFS_CNT_START_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.MP_Y_SIZE_INIT */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_MP_Y_SIZE_INIT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.MP_Y_SIZE_INIT */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_MP_Y_SIZE_INIT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.MP_Y_SIZE_INIT */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_MP_Y_SIZE_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.MP_Y_SIZE */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_MP_Y_SIZE_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.MP_Y_SIZE */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_MP_Y_SIZE_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.MP_Y_SIZE */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_MP_Y_SIZE_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_RIS_BUS_ERROR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_RIS_BUS_ERROR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_RIS_BUS_ERROR_OFF (10)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_RIS_FILL_MP_Y_LEN (1)

